#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL,"Ru");
	
	int a;
	cout << "Добро пожаловать в СBEERBANK"<<endl;
	cout << "Введите сумму от 1 до 9999 рублей, которую хотите снять: ";
	cin >> a;
//проверка на заданные параметры	
	if ((a > 0) && (a < 10000)) {
		cout << "Вы хотите снять:";
	}
	else {
		cout << "Неверное число";
	}
//проверка на тысячи
	if (((a / 1000) % 10) == 1)
		cout << " тысяча";
	else if (((a / 1000) % 10) == 2)
		cout << " две тысячи";
	else if (((a / 1000) % 10) == 3)
		cout << " три тысячи";
	else if (((a / 1000) % 10) == 4)
		cout << " четыре тысячи";
	else if (((a / 1000) % 10) == 5)
		cout << " пять тысяч ";
	else if (((a / 1000) % 10) == 6)
		cout << " шесть тысяч";
	else if (((a / 1000) % 10) == 7)
		cout << " семь тысяч";
	else if (((a / 1000) % 10) == 8)
		cout << " восемь тысяч";
	else if (((a / 1000) % 10) == 9)
		cout << " девять тысяч";
	if ((a % 1000) == 0)
		cout << " рублей";
//проверка на сотки 
	if (((a / 100) % 10) == 1)
		cout << " сто";
	else if (((a / 100) % 10) == 2)
		cout << " двести";
	else if (((a / 100) % 10) == 3)
		cout << " триста";
	else if (((a / 100) % 10) == 4)
		cout << " четыреста";
	else if (((a / 100) % 10) == 5)
		cout << " пятьсот";
	else if (((a / 100) % 10) == 6)
		cout << " шестьсот";
	else if (((a / 100) % 10) == 7)
		cout << " семьсот";
	else if (((a / 100) % 10) == 8)
		cout << " восемьсот";
	else if (((a / 100) % 10) == 9)
		cout << " девятьсот";
	if (((a % 100) == 0) && ((a%1000)!=0))
		cout << " рублей";
//если заканчивается десятком
	if ((a / 10) % 10 == 1)
	{
		if (a % 10 == 0)
			cout << " десять рублей";
		else if (a % 10 == 1)
			cout << " одиннадцать рублей";
		else if (a % 10 == 2)
			cout << " двенадцать рублей";
		else if (a % 10 == 3)
			cout << " тринадцать рублей";
		else if (a % 10 == 4)
			cout << " четырнадцать рублей";
		else if (a % 10 == 5)
			cout << " пятнадцать рублей";
		else if (a % 10 == 6)
			cout << " шестнадцать рублей";
		else if (a % 10 == 7)
			cout << " семнадцать рублей";
		else if (a % 10 == 8)
			cout << " восемнадцать рублей";
		else if (a % 10 == 1)
			cout << " девятнадцать рублей";
	}
//проверка на десятки
	if ((a / 10) % 10 != 1) {
		if (((a / 10) % 10) == 1)
			cout << " десять";
		else if (((a / 10) % 10) == 2)
			cout << " двадцать";
		else if (((a / 10) % 10) == 3)
			cout << " тридцать";
		else if (((a / 10) % 10) == 4)
			cout << " сорок";
		else if (((a / 10) % 10) == 5)
			cout << " пятьдесят";
		else if (((a / 10) % 10) == 6)
			cout << " шестьдясят";
		else if (((a / 10) % 10) == 7)
			cout << " семьдесят";
		else if (((a / 10) % 10) == 8)
			cout << " восемьдесят";
		else if (((a / 10) % 10) == 9)
			cout << " девяносто";
		if (((a % 1000) != 0) && ((a % 100) != 0) && ((a%10) == 0))
			cout << " рублей";
	}
// проверка на мелочь
	if ((a % 10) == 1) {
		cout << " один рубль";
	}
	else if ((a % 10) == 2)
		cout << " два рубля";
	else if ((a % 10) == 3)
		cout << " три рубля";
	else if ((a % 10) == 4)
		cout << " четыре рубля";
	else if ((a % 10) == 5)
		cout << " пять рублей";
	else if ((a % 10) == 6)
		cout << " шесть рублей";
	else if ((a % 10) == 7)
		cout << " семь рубелй";
	else if ((a % 10) == 8)
		cout << " восемь рублей";
	else if ((a % 10) == 9)
		cout << " девять рублей";

	
		
	return 0;
}
